#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # snowflake_database.db will be created
  + resource "snowflake_database" "db" {
      + data_retention_time_in_days = (known after apply)
      + id                          = (known after apply)
      + name                        = "TF_DEMO_DB_XY"
    }

  # snowflake_database_grant.grant will be created
  + resource "snowflake_database_grant" "grant" {
      + database_name          = "TF_DEMO_DB_XY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + privilege              = "USAGE"
      + roles                  = [
          + "TF_DEMO_DB_XY_SVC_ROLE",
        ]
      + with_grant_option      = false
    }

  # snowflake_role.role will be created
  + resource "snowflake_role" "role" {
      + id   = (known after apply)
      + name = "TF_DEMO_DB_XY_SVC_ROLE"
    }

  # snowflake_role_grants.grants will be created
  + resource "snowflake_role_grants" "grants" {
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + role_name              = "TF_DEMO_DB_XY_SVC_ROLE"
      + users                  = [
          + "TF_USR_DB_XY",
        ]
    }

  # snowflake_schema.schema will be created
  + resource "snowflake_schema" "schema" {
      + data_retention_days = 1
      + database            = "TF_DEMO_DB_XY"
      + id                  = (known after apply)
      + is_managed          = false
      + is_transient        = false
      + name                = "TF_SCH_DB_XY"
    }

  # snowflake_schema_grant.grant will be created
  + resource "snowflake_schema_grant" "grant" {
      + database_name          = "TF_DEMO_DB_XY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_future              = false
      + privilege              = "USAGE"
      + roles                  = [
          + "TF_DEMO_DB_XY_SVC_ROLE",
        ]
      + schema_name            = "TF_SCH_DB_XY"
      + with_grant_option      = false
    }

  # snowflake_user.user will be created
  + resource "snowflake_user" "user" {
      + default_namespace  = "TF_DEMO_DB_XY.TF_SCH_DB_XY"
      + default_role       = "TF_DEMO_DB_XY_SVC_ROLE"
      + default_warehouse  = "TF_WH_DB_XY"
      + disabled           = (known after apply)
      + display_name       = (known after apply)
      + has_rsa_public_key = (known after apply)
      + id                 = (known after apply)
      + login_name         = (known after apply)
      + name               = "TF_USR_DB_XY"
      + rsa_public_key     = (known after apply)
    }

  # snowflake_warehouse.warehouse will be created
  + resource "snowflake_warehouse" "warehouse" {
      + auto_resume                         = (known after apply)
      + auto_suspend                        = 60
      + id                                  = (known after apply)
      + max_cluster_count                   = (known after apply)
      + max_concurrency_level               = 8
      + min_cluster_count                   = (known after apply)
      + name                                = "TF_WH_DB_XY"
      + resource_monitor                    = (known after apply)
      + scaling_policy                      = (known after apply)
      + statement_queued_timeout_in_seconds = 0
      + statement_timeout_in_seconds        = 172800
      + warehouse_size                      = "small"
    }

  # snowflake_warehouse_grant.grant will be created
  + resource "snowflake_warehouse_grant" "grant" {
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + privilege              = "USAGE"
      + roles                  = [
          + "TF_DEMO_DB_XY_SVC_ROLE",
        ]
      + warehouse_name         = "TF_WH_DB_XY"
      + with_grant_option      = false
    }

  # tls_private_key.svc_key will be created
  + resource "tls_private_key" "svc_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + snowflake_svc_private_key = (sensitive value)
  + snowflake_svc_public_key  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @timtatol2, Action: `pull_request`, Working Directory: ``, Workflow: `Snowflake Terraform Demo Workflow`*